dict1 = {"小明": 334, "小白": 235, "小黑": 576, "小红": 7879, "小蓝": 878, "小绿": 8568}
"""
字典结构：key-value
key:不可重复,不能修改（所以不能是list，tuple，set）
"""
print(type(dict1))  # <class 'dict'>
dict1['小亮'] = 234
print(dict1)  # {'小明': 334, '小白': 235, '小黑': 576, '小红': 7879, '小蓝': 878, '小绿': 8568, '小亮': 234}

res = dict1.pop('小亮')
print(res)  # 234
print(dict1)  # {'小明': 334, '小白': 235, '小黑': 576, '小红': 7879, '小蓝': 878, '小绿': 8568}

del dict1['小绿']
print(dict1)  # {'小明': 334, '小白': 235, '小黑': 576, '小红': 7879, '小蓝': 878}

dict1['小白'] = 23456
print(dict1)  # {'小明': 334, '小白': 23456, '小黑': 576, '小红': 7879, '小蓝': 878}

print(dict1['小明'])  # 334
print(dict1.get('小黑'))  # 576不存在返回None
print(dict1.keys())  # ['小明', '小白','小黑','小红','小蓝']
print(dict1.values())  # [334, 23456,576,7879,878]
print(dict1.items())  # [('小明', 334), ('小白', 23456), ('小黑', 576), ('小红', 7879), ('小蓝', 878)]
for k, v in dict1.items():
    print(k, v)
    # """
    # 小明 334
    # 小白 23456
    # 小黑 576
    # 小红 7879
    # 小蓝 878
    # """

